# Задание 1_Pandas

In [15]:
import numpy as np
import pandas as pd

In [16]:
data = {'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, np.nan, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = [1,2,3,4]
print(data)

{'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'], 'age': [42, 33, 55, nan, 65, 23, 25, nan, 27, 37], 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

#### 0. Создать датафрейм.

In [17]:
df = pd.DataFrame(data)
df

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova   NaN       3      yes
4    Karpov  65.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

#### 1. Вывести информацию о датафрейме.

In [7]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Surname     10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

             age     visits
count   8.000000  10.000000
mean   38.375000   1.900000
std    14.994642   0.875595
min    23.000000   1.000000
25%    26.500000   1.000000
50%    35.000000   2.000000
75%    45.250000   2.750000
max    65.000000   3.000000

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [9]:
df.head(5)

   Surname   age  visits priority
0   Ivanov  42.0       1      yes
1   Petrov  33.0       3      yes
2  Sidorov  55.0       2       no
3  Ivanova   NaN       3      yes
4   Karpov  65.0       2       no

#### 3. Выберите только столбцы 'Surname' и 'age' из DataFrame `df`.

In [10]:
df[['Surname','age']]

    Surname   age
0    Ivanov  42.0
1    Petrov  33.0
2   Sidorov  55.0
3   Ivanova   NaN
4    Karpov  65.0
5      Hill  23.0
6      Boni  25.0
7  Mitchell   NaN
8      Onio  27.0
9    Lavrov  37.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['Surname', 'age']`.

In [11]:
df.loc[[3, 4, 8],['Surname','age']]

   Surname   age
3  Ivanova   NaN
4   Karpov  65.0
8     Onio  27.0

#### 5. Выберите строки где количество посещений банка больше 3.

In [12]:
df[df['visits']>=3]

   Surname   age  visits priority
1   Petrov  33.0       3      yes
3  Ivanova   NaN       3      yes
5     Hill  23.0       3       no

In [13]:
df[df['visits']>3]

Empty DataFrame
Columns: [Surname, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [18]:
df.fillna({'age':0})
df[df['age']==0.0]

Empty DataFrame
Columns: [Surname, age, visits, priority]
Index: []

#### 7. Выберите строки, в которых клиент был больше 2х раз в банке * и * возраст составляет более 30 лет.

In [19]:
df[(df['age'] >= 30) &  (df['visits'] >= 2)]

   Surname   age  visits priority
1   Petrov  33.0       3      yes
2  Sidorov  55.0       2       no
4   Karpov  65.0       2       no

#### 8. Выберите строки в которых возраст от 55 до 65 (включительно).

In [20]:
 df[df['age']>=55]

   Surname   age  visits priority
2  Sidorov  55.0       2       no
4   Karpov  65.0       2       no

#### 9. Измените возраст в строке '4' на 44.

In [21]:
data = {'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, 44, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
df = pd.DataFrame(data)
df

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova  44.0       3      yes
4    Karpov  65.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [22]:
df.visits.agg('sum')

19

#### 11. Расчитайте средний возраст клиентов

In [23]:
df.age.agg('mean')

39.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [24]:
df = pd.DataFrame(np.array([['Kormiltseva',29,5,"yes"]]), \
        columns=["Surname", "age", "visits","priority"]).append(df, ignore_index=True)
df

        Surname  age visits priority
0   Kormiltseva   29      5      yes
1        Ivanov   42      1      yes
2        Petrov   33      3      yes
3       Sidorov   55      2       no
4       Ivanova   44      3      yes
5        Karpov   65      2       no
6          Hill   23      3       no
7          Boni   25      1       no
8      Mitchell  NaN      1      yes
9          Onio   27      2       no
10       Lavrov   37      1       no

#### 13. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

#### 14. В столбце приоритет замените значения на `Yes` и `No`

In [27]:
data = {'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, 44, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['Yes', 'Yes', 'No', 'Yes', 'No', 'No', 'No', 'Yes', 'No', 'No']}
df = pd.DataFrame(data)
df

    Surname   age  visits priority
0    Ivanov  42.0       1      Yes
1    Petrov  33.0       3      Yes
2   Sidorov  55.0       2       No
3   Ivanova  44.0       3      Yes
4    Karpov  65.0       2       No
5      Hill  23.0       3       No
6      Boni  25.0       1       No
7  Mitchell   NaN       1      Yes
8      Onio  27.0       2       No
9    Lavrov  37.0       1       No

#### 15. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [28]:
df = pd.DataFrame (np.random.random (size = (10,5)), columns = ('A','B','C','D','E'))
df
df.describe()

               A          B          C          D          E
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.417620   0.596581   0.520603   0.618414   0.434542
std     0.289480   0.322202   0.311488   0.178967   0.325940
min     0.027003   0.099340   0.016118   0.219820   0.035785
25%     0.194160   0.350140   0.257791   0.585313   0.164483
50%     0.356364   0.688563   0.655958   0.640345   0.391214
75%     0.693914   0.842829   0.776965   0.694308   0.655767
max     0.852636   0.949148   0.841665   0.828998   0.930739

#### 16. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [29]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [30]:
df.value.mean

<bound method Series.mean of 0     1.0
1     2.0
2     3.0
3     NaN
4     2.0
5     3.0
6     NaN
7     1.0
8     7.0
9     3.0
10    NaN
11    8.0
Name: value, dtype: float64>

#### 17. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

#### 23. Загрузить свою таблицу данных(из реферата, курсовой, из сайта статистических данных). 

Выполните действия с таблицей:

Загрузите таблицу из файла и сохраните ее в переменную df. Используйте функцию read_

Выведите общую информацию по таблице: число строк и столбцов, типы данных в таблице. 

Есть ли в таблице пропущенные значения?

Если в таблице есть строки с пропущенными значениями, удалите их.

Сохраните изменения в df.

Выведите на экран описательные статистики по всем количественным переменным в таблице. 

Выберите какой-нибудь интересующий вас столбец и проинтерпретируйте описательные статистики по нему (т.е. опишите «обычными» словами, что значат значения типа min, std, 50% и так далее).


Переименуйте какие-нибудь столбцы в таблице (хотя бы один, можно несколько) и сохраните изменения в df.

Добавьте новые столбцы.

ссылки на сайты стат данных

    
https://data.gov.ru/taxonomy/term/9/datasets
    
http://sophist.hse.ru/rstat/

можно взять данные из задач 

https://github.com/hightemp/docNN/blob/b96f37611dd3ebdd5b2269e04582683af74b8340/articles/%D0%9F%D1%80%D0%B8%D0%BC%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BC%D0%B0%D1%88%D0%B8%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE%20%D0%BE%D0%B1%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%B8%20Data%20Science%20%D0%B2%20%D0%BF%D1%80%D0%BE%D0%BC%D1%8B%D1%88%D0%BB%D0%B5%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8.md